SpenceKonde/DxCore/megaavr/variants/64pin-standard/pins_arduino.h
#ifndef Pins_Arduino_h
#define Pins_Arduino_h


#include <avr/pgmspace.h>
#include "timers.h"
/*     ##  #     # ####      ###        #   #  #
      #  # #     # #   #     #  #      #    #  #
      ####  #   #  ####      #  # # # ####  ####
      #  #   # #   # #       #  #  #  #   #    #
      #  #    #    #  #      ###  # #  ###     #                              */
#define DEFAULT_64PIN_PINOUT

// Arduino pin macros
#define PIN_PA0 (0)
#define PIN_PA1 (1)
#define PIN_PA2 (2)
#define PIN_PA3 (3)
#define PIN_PA4 (4)
#define PIN_PA5 (5)
#define PIN_PA6 (6)
#define PIN_PA7 (7)
#define PIN_PB0 (8)
#define PIN_PB1 (9)
#define PIN_PB2 (10)
#define PIN_PB3 (11)
#define PIN_PB4 (12)
#define PIN_PB5 (13)
#define PIN_PB6 (14)
#define PIN_PB7 (15)
#define PIN_PC0 (16)
#define PIN_PC1 (17)
#define PIN_PC2 (18)
#define PIN_PC3 (19)
#define PIN_PC4 (20)
#define PIN_PC5 (21)
#define PIN_PC6 (22)
#define PIN_PC7 (23)
#define PIN_PD0 (24)
#define PIN_PD1 (25)
#define PIN_PD2 (26)
#define PIN_PD3 (27)
#define PIN_PD4 (28)
#define PIN_PD5 (29)
#define PIN_PD6 (30)
#define PIN_PD7 (31)
#define PIN_PE0 (32)
#define PIN_PE1 (33)
#define PIN_PE2 (34)
#define PIN_PE3 (35)
#define PIN_PE4 (36)
#define PIN_PE5 (37)
#define PIN_PE6 (38)
#define PIN_PE7 (39)
#define PIN_PF0 (40)
#define PIN_PF1 (41)
#define PIN_PF2 (42)
#define PIN_PF3 (43)
#define PIN_PF4 (44)
#define PIN_PF5 (45)
#define PIN_PG0 (46)
#define PIN_PG1 (47)
#define PIN_PG2 (48)
#define PIN_PG3 (49)
#define PIN_PG4 (50)
#define PIN_PG5 (51)
#define PIN_PG6 (52)
#define PIN_PG7 (53)
#define PIN_PF6 (54) /* RESET can be used as an input via fuse setting. It poses no reprogramming challenges, and has no output drivers. */
/*      PIN_PF7 (55) UPDI pin not available for alternative functions */

#define NUM_DIGITAL_PINS                  55
#define NUM_ANALOG_INPUTS                 22
/* Anyone know of a document describing *exactly* what each of these should be and how people are to use it? */
#define NUM_RESERVED_PINS                 0  /* Is this USED by ANYTHING?! How is a "reserved pin" defined? */
#define NUM_INTERNALLY_USED_PINS          0  /* Is this USED by ANYTHING?! How are these different from reserved pins?*/
#define NUM_I2C_PINS                      2
#define NUM_SPI_PINS                      3
#define NUM_TOTAL_FREE_PINS               (NUM_DIGITAL_PINS) /* Is this even used by ANYTHING?! */
#define NUM_TOTAL_PINS                    (NUM_DIGITAL_PINS)
#define EXTERNAL_NUM_INTERRUPTS           (56) //needs one extra - see WInterrupts; the low 3 bits are the bit-within-port, rest is port number.

/* I wasn't able to determine what *exactly* this is supposed to contain for more parts than not on the listof parts that I couldn't say
what this ought to be! So commenting out - if no compatibility is broken? Great! If it is? Great now I know were to look an see how this is used.
//#define ANALOG_INPUT_OFFSET             24 //Hopefully not used elsewhere!
I am pretty sure it hasn't been used in eons, if it ever was; if you find something that uses it, please let me know so I can in study how it is used
and hence what number it should be set to! */

#if !defined(LED_BUILTIN)
  #define LED_BUILTIN                     PIN_PA7
#endif

#define digitalPinToAnalogInput(p)        ((((p) >= PIN_PC7) && ((p) < PIN_PF6)) ? ((p) - PIN_PD0) : NOT_A_PIN)
#define analogChannelToDigitalPin(p)      ((p) < 22 ? ((p) + PIN_PD0) : NOT_A_PIN)
#define analogInputToDigitalPin(p)                        analogChannelToDigitalPin((p) & 0x7F)
#define digitalOrAnalogPinToDigital(p)    (((p) & 0x80) ? analogChannelToDigitalPin((p) & 0x7f) : (((p)<=NUM_DIGITAL_PINS) ? (p) : NOT_A_PIN)) /* handle analog channels too */
#define portToPinZero(port)               (((port) < PG) ? (port) * 8 : (port == PG ? 46 : NOT_A_PIN));

#if defined(MILLIS_USE_TIMERB0)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PB4) || ((p) == PIN_PB5) || ((p) == PIN_PF5) || ((p) == PIN_PG3))
#elif defined(MILLIS_USE_TIMERB1)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PB4) || ((p) == PIN_PB5) || ((p) == PIN_PF4) || ((p) == PIN_PG3))
#elif defined(MILLIS_USE_TIMERB2)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PB5) || ((p) == PIN_PF4) || ((p) == PIN_PF5) || ((p) == PIN_PG3))
#elif defined(MILLIS_USE_TIMERB3)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PB4) || ((p) == PIN_PF4) || ((p) == PIN_PF5) || ((p) == PIN_PG3))
#elif defined(MILLIS_USE_TIMERB4)
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PB4) || ((p) == PIN_PF4) || ((p) == PIN_PF5) || ((p) == PIN_PB5))
#else //no TCB's are used for millis
  #define digitalPinHasPWMTCB(p) (((p) == PIN_PB4) || ((p) == PIN_PB5) || ((p) == PIN_PF4) || ((p) == PIN_PF5) || ((p) == PIN_PG3))
#endif

// Timer pin swaps
#define TCA0_PINS PORTMUX_TCA0_PORTC_gc     // TCA0 output on PC[0:5] after init() (alt 2)
#define TCA1_PINS 0x00                      // TCA1 output on PB[0:5] after init() (no pinswap)
#define TCB0_PINS PORTMUX_TCB0_bm           // TCB0 output on PF4 instead of PA2 (default)
#define TCB1_PINS PORTMUX_TCB1_bm           // TCB1 output on PF5 instead of PA3 (default)
#define TCB2_PINS 0x00                      // TCB2 output on PC0 (default) instead of PB4 (default)
#define TCB3_PINS PORTMUX_TCB3_bm           // TCB3 output on PC1 instead of PB5 (default)
#define TCB4_PINS 0x00                      // TCB4 output on PG3 (default) instead of PC6
#define TCD0_PINS PORTMUX_TCD0_DEFAULT_gc   // TCD0 output on PA[4:7] (default - only default port option works on DA, DB parts=).
// Setting TCB2 and TCB3 for PWM on PC0, PC1 doesn't sound optimal for the AVR DB, but you shouldn't be using TCBs for PWM anyway!
// They are there as a last resort, not a first resort.
#define PIN_TCA0_WO0_INIT PIN_PC0
#define PIN_TCA1_WO0_INIT PIN_PB0
#define PIN_TCD0_WOA_INIT PIN_PA4

#define USE_TIMERD0_PWM
#define NO_GLITCH_TIMERD0

#define digitalPinHasPWM(p)               (digitalPinHasPWMTCB(p) || ((p) >= PIN_PA4 && (p) <= PIN_PC5 && (p) != PIN_PB6 && (p) != PIN_PB6))


/*          ####   ###  ####  ##### #   # #   # #   #
            #   # #   # #   #   #   ## ## #   #  # #
            ####  #   # ####    #   # # # #   #   #
            #     #   # # #     #   #   # #   #  # #
            #      ###  #  #    #   #   #  ###  #   #                         */

