SpenceKonde/DxCore/megaavr/variants/64pin-standard/pins_arduino.h
#define SPI_INTERFACES_COUNT   1 /* See SPI.h +*/

// SPI 0
#define SPI_MUX                (PORTMUX_SPI0_DEFAULT_gc)
#define SPI_MUX_PINSWAP_1      (PORTMUX_SPI0_ALT1_gc)
#define SPI_MUX_PINSWAP_2      (PORTMUX_SPI0_ALT2_gc)
#define PIN_SPI_MOSI           PIN_PA4
#define PIN_SPI_MISO           PIN_PA5
#define PIN_SPI_SCK            PIN_PA6
#define PIN_SPI_SS             PIN_PA7
#define PIN_SPI_MOSI_PINSWAP_1 PIN_PE0
#define PIN_SPI_MISO_PINSWAP_1 PIN_PE1
#define PIN_SPI_SCK_PINSWAP_1  PIN_PE2
#define PIN_SPI_SS_PINSWAP_1   PIN_PE3
#define PIN_SPI_MOSI_PINSWAP_2 PIN_PG4
#define PIN_SPI_MISO_PINSWAP_2 PIN_PG5
#define PIN_SPI_SCK_PINSWAP_2  PIN_PG6
#define PIN_SPI_SS_PINSWAP_2   PIN_PG7

// SPI 1
#define SPI1_MUX                (PORTMUX_SPI1_DEFAULT_gc)
#define SPI1_MUX_PINSWAP_1      (PORTMUX_SPI1_ALT1_gc)
#define SPI1_MUX_PINSWAP_2      (PORTMUX_SPI1_ALT2_gc)
#define PIN_SPI1_MOSI           PIN_PC0
#define PIN_SPI1_MISO           PIN_PC1
#define PIN_SPI1_SCK            PIN_PC2
#define PIN_SPI1_SS             PIN_PC3
#define PIN_SPI1_MOSI_PINSWAP_1 PIN_PC4
#define PIN_SPI1_MISO_PINSWAP_1 PIN_PC5
#define PIN_SPI1_SCK_PINSWAP_1  PIN_PC6
#define PIN_SPI1_SS_PINSWAP_1   PIN_PC7
#define PIN_SPI1_MOSI_PINSWAP_2 PIN_PB4
#define PIN_SPI1_MISO_PINSWAP_2 PIN_PB5
#define PIN_SPI1_SCK_PINSWAP_2  PIN_PB6
#define PIN_SPI1_SS_PINSWAP_2   PIN_PB7


// TWI 0
#define PIN_WIRE_SDA           PIN_PA2
#define PIN_WIRE_SCL           PIN_PA3
#define PIN_WIRE_SDA_PINSWAP_1 PIN_PA2
#define PIN_WIRE_SCL_PINSWAP_1 PIN_PA3
#define PIN_WIRE_SDA_PINSWAP_2 PIN_PC2
#define PIN_WIRE_SCL_PINSWAP_2 PIN_PC3


// TWI 1
#define PIN_WIRE1_SDA           PIN_PF2
#define PIN_WIRE1_SCL           PIN_PF3
#define PIN_WIRE1_SDA_PINSWAP_1 PIN_PF2
#define PIN_WIRE1_SCL_PINSWAP_1 PIN_PF3
#define PIN_WIRE1_SDA_PINSWAP_2 PIN_PB2
#define PIN_WIRE1_SCL_PINSWAP_2 PIN_PB3

#define NUM_HWSERIAL_PORTS              6

// USART 0
#define HWSERIAL0                       &USART0               /* So far I see no reason not to just use &USART0 here...    */
#define HWSERIAL0_DRE_VECTOR            USART0_DRE_vect       /* Nope - we can determine this already, is pure duplication */
#define HWSERIAL0_DRE_VECTOR_NUM        USART0_DRE_vect_num   /* Nope - that AND it's not even used anymore */
#define HWSERIAL0_RXC_VECTOR            USART0_RXC_vect
#define HWSERIAL0_MUX_COUNT             2                     /* stays - can be deduced, but only in ugly ways */
#define HWSERIAL0_MUX                   PORTMUX_USART0_DEFAULT_gc  /* Nope, redundant */
#define HWSERIAL0_MUX_PINSWAP_1         PORTMUX_USART0_ALT1_gc     /* Nope, redundant - also horribly verbose and ugly*/
#define HWSERIAL0_MUX_PINSWAP_NONE      PORTMUX_USART0_NONE_gc     /* Wasn't there before anyway */
#define PIN_HWSERIAL0_TX                PIN_PA0               /* All the pins stay */
#define PIN_HWSERIAL0_RX                PIN_PA1
#define PIN_HWSERIAL0_XCK               PIN_PA2
#define PIN_HWSERIAL0_XDIR              PIN_PA3
#define PIN_HWSERIAL0_TX_PINSWAP_1      PIN_PA4
#define PIN_HWSERIAL0_RX_PINSWAP_1      PIN_PA5
#define PIN_HWSERIAL0_XCK_PINSWAP_1     PIN_PA6
#define PIN_HWSERIAL0_XDIR_PINSWAP_1    PIN_PA7

// USART1
#define HWSERIAL1                       &USART1
#define HWSERIAL1_DRE_VECTOR            USART1_DRE_vect
#define HWSERIAL1_DRE_VECTOR_NUM        USART1_DRE_vect_num
#define HWSERIAL1_RXC_VECTOR            USART1_RXC_vect
#define HWSERIAL1_MUX_COUNT             2
#define HWSERIAL1_MUX                   PORTMUX_USART1_DEFAULT_gc
#define HWSERIAL1_MUX_PINSWAP_1         PORTMUX_USART1_ALT1_gc
#define HWSERIAL1_MUX_PINSWAP_NONE      PORTMUX_USART1_NONE_gc
#define PIN_HWSERIAL1_TX                PIN_PC0
#define PIN_HWSERIAL1_RX                PIN_PC1
#define PIN_HWSERIAL1_XCK               PIN_PC2
#define PIN_HWSERIAL1_XDIR              PIN_PC3
#define PIN_HWSERIAL1_TX_PINSWAP_1      PIN_PC4
#define PIN_HWSERIAL1_RX_PINSWAP_1      PIN_PC5
#define PIN_HWSERIAL1_XCK_PINSWAP_1     PIN_PC6
#define PIN_HWSERIAL1_XDIR_PINSWAP_1    PIN_PC7

// USART 2
#define HWSERIAL2                       &USART2
#define HWSERIAL2_DRE_VECTOR            USART2_DRE_vect
#define HWSERIAL2_DRE_VECTOR_NUM        USART2_DRE_vect_num
#define HWSERIAL2_RXC_VECTOR            USART2_RXC_vect
#define HWSERIAL2_MUX_COUNT             2
#define HWSERIAL2_MUX                   PORTMUX_USART2_DEFAULT_gc
#define HWSERIAL2_MUX_PINSWAP_1         PORTMUX_USART2_ALT1_gc
#define HWSERIAL2_MUX_PINSWAP_NONE      PORTMUX_USART2_NONE_gc
#define PIN_HWSERIAL2_TX                PIN_PF0
#define PIN_HWSERIAL2_RX                PIN_PF1
#define PIN_HWSERIAL2_XCK               PIN_PF2
#define PIN_HWSERIAL2_XDIR              PIN_PF3
#define PIN_HWSERIAL2_TX_PINSWAP_1      PIN_PF4
#define PIN_HWSERIAL2_RX_PINSWAP_1      PIN_PF5
#define PIN_HWSERIAL2_XCK_PINSWAP_1     NOT_A_PIN
#define PIN_HWSERIAL2_XDIR_PINSWAP_1    NOT_A_PIN

// USART 3
#define HWSERIAL3                       &USART3
#define HWSERIAL3_DRE_VECTOR            USART3_DRE_vect
#define HWSERIAL3_DRE_VECTOR_NUM        USART3_DRE_vect_num
#define HWSERIAL3_RXC_VECTOR            USART3_RXC_vect
#define HWSERIAL3_MUX_COUNT             2
#define HWSERIAL3_MUX                   PORTMUX_USART3_DEFAULT_gc
#define HWSERIAL3_MUX_PINSWAP_1         PORTMUX_USART3_ALT1_gc
#define HWSERIAL3_MUX_PINSWAP_NONE      PORTMUX_USART3_NONE_gc
#define PIN_HWSERIAL3_TX                PIN_PB0
#define PIN_HWSERIAL3_RX                PIN_PB1
#define PIN_HWSERIAL3_XCK               PIN_PB2
#define PIN_HWSERIAL3_XDIR              PIN_PB3
#define PIN_HWSERIAL3_TX_PINSWAP_1      PIN_PB4
#define PIN_HWSERIAL3_RX_PINSWAP_1      PIN_PB5
#define PIN_HWSERIAL3_XCK_PINSWAP_1     PIN_PB6
#define PIN_HWSERIAL3_XDIR_PINSWAP_1    PIN_PB7

// USART 4
#define HWSERIAL4                       &USART4
#define HWSERIAL4_DRE_VECTOR            USART4_DRE_vect
#define HWSERIAL4_DRE_VECTOR_NUM        USART4_DRE_vect_num
#define HWSERIAL4_RXC_VECTOR            USART4_RXC_vect
#define HWSERIAL4_MUX_COUNT             2
#define HWSERIAL4_MUX                   PORTMUX_USART4_DEFAULT_gc
#define HWSERIAL4_MUX_PINSWAP_1         PORTMUX_USART4_ALT1_gc
#define HWSERIAL4_MUX_PINSWAP_NONE      PORTMUX_USART4_NONE_gc
#define PIN_HWSERIAL4_TX                PIN_PE0
#define PIN_HWSERIAL4_RX                PIN_PE1
#define PIN_HWSERIAL4_XCK               PIN_PE2
#define PIN_HWSERIAL4_XDIR              PIN_PE3
#define PIN_HWSERIAL4_TX_PINSWAP_1      PIN_PE4
#define PIN_HWSERIAL4_RX_PINSWAP_1      PIN_PE5
#define PIN_HWSERIAL4_XCK_PINSWAP_1     PIN_PE6
#define PIN_HWSERIAL4_XDIR_PINSWAP_1    PIN_PE7

// USART 5
#define HWSERIAL5                       &USART5
#define HWSERIAL5_DRE_VECTOR            USART5_DRE_vect
#define HWSERIAL5_DRE_VECTOR_NUM        USART5_DRE_vect_num
#define HWSERIAL5_RXC_VECTOR            USART5_RXC_vect
#define HWSERIAL5_MUX_COUNT             2
#define HWSERIAL5_MUX                   PORTMUX_USART5_DEFAULT_gc
#define HWSERIAL5_MUX_PINSWAP_1         PORTMUX_USART5_ALT1_gc
#define HWSERIAL5_MUX_PINSWAP_NONE      PORTMUX_USART5_NONE_gc
#define PIN_HWSERIAL5_TX                PIN_PG0
#define PIN_HWSERIAL5_RX                PIN_PG1
#define PIN_HWSERIAL5_XCK               PIN_PG2
#define PIN_HWSERIAL5_XDIR              PIN_PG3
#define PIN_HWSERIAL5_TX_PINSWAP_1      PIN_PG4
#define PIN_HWSERIAL5_RX_PINSWAP_1      PIN_PG5
#define PIN_HWSERIAL5_XCK_PINSWAP_1     PIN_PG6
#define PIN_HWSERIAL5_XDIR_PINSWAP_1    PIN_PG7

