SpenceKonde/DxCore/megaavr/variants/64pin-standard/pins_arduino.h
/*
       ##  #   #  ##  #     ###   ###      ####  ### #   #  ###
      #  # ##  # #  # #    #   # #         #   #  #  ##  # #
      #### # # # #### #    #   # #  ##     ####   #  # # #  ###
      #  # #  ## #  # #    #   # #   #     #      #  #  ##     #
      #  # #   # #  # ####  ###   ###      #     ### #   #  ###
*/

#define PIN_A0   PIN_PD0
#define PIN_A1   PIN_PD1
#define PIN_A2   PIN_PD2
#define PIN_A3   PIN_PD3
#define PIN_A4   PIN_PD4
#define PIN_A5   PIN_PD5
#define PIN_A6   PIN_PD6
#define PIN_A7   PIN_PD7
#define PIN_A8   PIN_PE0
#define PIN_A9   PIN_PE1
#define PIN_A10  PIN_PE2
#define PIN_A11  PIN_PE3
#define PIN_A12  PIN_PE4
#define PIN_A13  PIN_PE5
#define PIN_A14  PIN_PE6
#define PIN_A15  PIN_PE7
#define PIN_A16  PIN_PF0
#define PIN_A17  PIN_PF1
#define PIN_A18  PIN_PF2
#define PIN_A19  PIN_PF3
#define PIN_A20  PIN_PF4
#define PIN_A21  PIN_PF5

static const uint8_t A0  = PIN_A0;
static const uint8_t A1  = PIN_A1;
static const uint8_t A2  = PIN_A2;
static const uint8_t A3  = PIN_A3;
static const uint8_t A4  = PIN_A4;
static const uint8_t A5  = PIN_A5;
static const uint8_t A6  = PIN_A6;
static const uint8_t A7  = PIN_A7;
static const uint8_t A8  = PIN_A8;
static const uint8_t A9  = PIN_A9;
static const uint8_t A10 = PIN_A10;
static const uint8_t A11 = PIN_A11;
static const uint8_t A12 = PIN_A12;
static const uint8_t A13 = PIN_A13;
static const uint8_t A14 = PIN_A14;
static const uint8_t A15 = PIN_A15;
static const uint8_t A16 = PIN_A16;
static const uint8_t A17 = PIN_A17;
static const uint8_t A18 = PIN_A18;
static const uint8_t A19 = PIN_A19;
static const uint8_t A20 = PIN_A20;
static const uint8_t A21 = PIN_A21;
/* AINn = (0x80 | n)
 * can be turned into digital pins with analogInputToDigitalPin(), but do not
 * directly work in digital I/O (this can be changed, but I'd rather not have
 * to, as it slows down every non-compiletime-known call to digital I/O. Just
 * because these parts can be clocked higher doesn't mean we should bog them
 * down until they run slower. */
#define  AIN0  ADC_CH(0)
#define  AIN1  ADC_CH(1)
#define  AIN2  ADC_CH(2)
#define  AIN3  ADC_CH(3)
#define  AIN4  ADC_CH(4)
#define  AIN5  ADC_CH(5)
#define  AIN6  ADC_CH(6)
#define  AIN7  ADC_CH(7)
#define  AIN8  ADC_CH(8)
#define  AIN9  ADC_CH(9)
#define AIN10 ADC_CH(10)
#define AIN11 ADC_CH(11)
#define AIN12 ADC_CH(12)
#define AIN13 ADC_CH(13)
#define AIN14 ADC_CH(14)
#define AIN15 ADC_CH(15)
#define AIN16 ADC_CH(16)
#define AIN17 ADC_CH(17)
#define AIN18 ADC_CH(18)
#define AIN19 ADC_CH(19)
#define AIN20 ADC_CH(20)
#define AIN21 ADC_CH(21)


/*
            ####  ### #   #      ##  ####  ####   ##  #   #  ###
            #   #  #  ##  #     #  # #   # #   # #  #  # #  #
            ####   #  # # #     #### ####  ####  ####   #    ###
            #      #  #  ##     #  # # #   # #   #  #   #       #
            #     ### #   #     #  # #  #  #  #  #  #   #    ###
*/
#ifdef ARDUINO_MAIN

const uint8_t digital_pin_to_port[] = {
  #if CLOCK_SOURCE == 0
    // PA0 used for external clock and crystal.
    PA,  //   0 PA0
  #else
    NOT_A_PORT,
  #endif
  #if CLOCK_SOURCE != 1 && !defined(PIN_XOSCEN_PA1)
    PA,  //   1 PA1
  #else
    // PA1 used for external crystal, and possibly the enable line of external clock.
    NOT_A_PORT,
  #endif
  PA,  //   2 PA2
  PA,  //   3 PA3
  PA,  //   4 PA4
  PA,  //   5 PA5
  PA,  //   6 PA6
  PA,  //   7 PA7
  PB,  //   8 PB0
  PB,  //   9 PB1
  PB,  //  10 PB2
  PB,  //  11 PB3
  PB,  //  12 PB4
  PB,  //  13 PB5
  PB,  //  14 PB6
  PB,  //  15 PB7
  PC,  //  16 PC0
  PC,  //  17 PC1
  PC,  //  18 PC2
  PC,  //  19 PC3
  PC,  //  20 PC4
  PC,  //  21 PC5
  PC,  //  22 PC6
  PC,  //  23 PC7
  PD,  //  24 PD0
  PD,  //  25 PD1
  PD,  //  26 PD2
  PD,  //  27 PD3
  PD,  //  28 PD4
  PD,  //  29 PD5
  PD,  //  30 PD6
  PD,  //  31 PD7
  PE,  //  32 PE0
  PE,  //  33 PE1
  PE,  //  34 PE2
  PE,  //  35 PE3
  PE,  //  36 PE4
  PE,  //  37 PE5
  PE,  //  38 PE6
  PE,  //  39 PE7
  PF,  //  40 PF0
  PF,  //  41 PF1
  PF,  //  42 PF2
  PF,  //  43 PF3
  PF,  //  44 PF4
  PF,  //  45 PF5
  PG,  //  46 PG0
  PG,  //  47 PG1
  PG,  //  48 PG2
  PG,  //  49 PG3
  PG,  //  50 PG4
  PG,  //  51 PG5
  PG,  //  52 PG6
  PG,  //  53 PG7
  PF,  //  54 PF6
};

/* Use this for accessing PINnCTRL register */
const uint8_t digital_pin_to_bit_position[] = {
  #if CLOCK_SOURCE == 0
    // PA0 used for external clock and crystal.
    PIN0_bp,  //   0 PA0
  #else
    NOT_A_PIN,
  #endif
  #if CLOCK_SOURCE != 1 && !defined(PIN_XOSCEN_PA1)
    PIN1_bp,  //   1 PA1
  #else
    // PA1 used for external crystal.
    NOT_A_PIN,
  #endif
  PIN2_bp,  //   2 PA2
  PIN3_bp,  //   3 PA3
  PIN4_bp,  //   4 PA4
  PIN5_bp,  //   5 PA5
  PIN6_bp,  //   6 PA6
  PIN7_bp,  //   7 PA7
  PIN0_bp,  //   8 PB0
  PIN1_bp,  //   9 PB1
  PIN2_bp,  //  10 PB2
  PIN3_bp,  //  11 PB3
  PIN4_bp,  //  12 PB4
  PIN5_bp,  //  13 PB5
  PIN6_bp,  //  14 PB6
  PIN7_bp,  //  15 PB7
  PIN0_bp,  //  16 PC0
  PIN1_bp,  //  17 PC1
  PIN2_bp,  //  18 PC2
  PIN3_bp,  //  19 PC3
  PIN4_bp,  //  20 PC4
  PIN5_bp,  //  21 PC5
  PIN6_bp,  //  22 PC6
  PIN7_bp,  //  23 PC7
  PIN0_bp,  //  24 PD0
  PIN1_bp,  //  25 PD1
  PIN2_bp,  //  26 PD2
  PIN3_bp,  //  27 PD3
  PIN4_bp,  //  28 PD4
  PIN5_bp,  //  29 PD5
  PIN6_bp,  //  30 PD6
  PIN7_bp,  //  31 PD7
  PIN0_bp,  //  32 PE0
  PIN1_bp,  //  33 PE1
  PIN2_bp,  //  34 PE2
  PIN3_bp,  //  35 PE3
  PIN4_bp,  //  36 PE4
  PIN5_bp,  //  37 PE5
  PIN6_bp,  //  38 PE6
  PIN7_bp,  //  39 PE7
  PIN0_bp,  //  40 PF0
  PIN1_bp,  //  41 PF1
  PIN2_bp,  //  42 PF2
  PIN3_bp,  //  43 PF3
  PIN4_bp,  //  44 PF4
  PIN5_bp,  //  45 PF5
  PIN0_bp,  //  46 PG0
  PIN1_bp,  //  47 PG1
  PIN2_bp,  //  48 PG2
  PIN3_bp,  //  49 PG3
  PIN4_bp,  //  50 PG4
  PIN5_bp,  //  51 PG5
  PIN6_bp,  //  52 PG6
  PIN7_bp,  //  53 PG7
  PIN6_bp,  //  54 PF6
};

const uint8_t digital_pin_to_bit_mask[] = {
  #if CLOCK_SOURCE == 0
    // PA0 used for external clock and crystal.
    PIN0_bm,  //   0 PA0
  #else
    NOT_A_PIN,
  #endif
  #if CLOCK_SOURCE != 1 && !defined(PIN_XOSCEN_PA1)
    PIN1_bm,  //   1 PA1
  #else
    // PA1 used for external crystal.
    NOT_A_PIN,
  #endif
  PIN2_bm,  //   2 PA2
  PIN3_bm,  //   3 PA3
  PIN4_bm,  //   4 PA4
  PIN5_bm,  //   5 PA5
  PIN6_bm,  //   6 PA6
  PIN7_bm,  //   7 PA7
  PIN0_bm,  //   8 PB0
  PIN1_bm,  //   9 PB1
  PIN2_bm,  //  10 PB2
  PIN3_bm,  //  11 PB3
  PIN4_bm,  //  12 PB4
  PIN5_bm,  //  13 PB5
  PIN6_bm,  //  14 PB6
  PIN7_bm,  //  15 PB7
  PIN0_bm,  //  16 PC0
  PIN1_bm,  //  17 PC1
  PIN2_bm,  //  18 PC2
  PIN3_bm,  //  19 PC3
  PIN4_bm,  //  20 PC4
  PIN5_bm,  //  21 PC5
  PIN6_bm,  //  22 PC6
  PIN7_bm,  //  23 PC7
  PIN0_bm,  //  24 PD0
  PIN1_bm,  //  25 PD1
  PIN2_bm,  //  26 PD2
  PIN3_bm,  //  27 PD3
  PIN4_bm,  //  28 PD4
  PIN5_bm,  //  29 PD5
  PIN6_bm,  //  30 PD6
  PIN7_bm,  //  31 PD7
  PIN0_bm,  //  32 PE0
  PIN1_bm,  //  33 PE1
  PIN2_bm,  //  34 PE2
  PIN3_bm,  //  35 PE3
  PIN4_bm,  //  36 PE4
  PIN5_bm,  //  37 PE5
  PIN6_bm,  //  38 PE6
  PIN7_bm,  //  39 PE7
  PIN0_bm,  //  40 PF0
  PIN1_bm,  //  41 PF1
  PIN2_bm,  //  42 PF2
  PIN3_bm,  //  43 PF3
  PIN4_bm,  //  44 PF4
  PIN5_bm,  //  45 PF5
  PIN0_bm,  //  46 PG0
  PIN1_bm,  //  47 PG1
  PIN2_bm,  //  48 PG2
  PIN3_bm,  //  49 PG3
  PIN4_bm,  //  50 PG4
  PIN5_bm,  //  51 PG5
  PIN6_bm,  //  52 PG6
  PIN7_bm,  //  53 PG7
  PIN6_bm,  //  54 PF6
};

/* This only covers type B amd (for now) type D timers
   once hardware with working TCD portmux is available
   it will not cover type D timers either - the pins
   will be determined at runtime from the
   PORTMUX.TCDROUTEA register, so that users can set
   that to a different set of pins and  */
const uint8_t digital_pin_to_timer[] = {
  NOT_ON_TIMER, //   0 PA0
  NOT_ON_TIMER, //   1 PA1
  NOT_ON_TIMER, //   2 PA2
  NOT_ON_TIMER, //   3 PA3
  TIMERD0,      //   4 PA4/MOSI      WOA
  TIMERD0,      //   5 PA5/MISO      WOB
  TIMERD0,      //   6 PA6/SCK       WOC mirrors WOA
  TIMERD0,      //   7 PA7/SS/CLKOUT WOD mirrors WOB
  NOT_ON_TIMER, //   8 PB0
  NOT_ON_TIMER, //   9 PB1
  NOT_ON_TIMER, //  10 PB2
  NOT_ON_TIMER, //  11 PB3
  NOT_ON_TIMER, //  12 PB4
  NOT_ON_TIMER, //  13 PB5
  NOT_ON_TIMER, //  14 PB6
  NOT_ON_TIMER, //  15 PB7
  TIMERB2,      //  16 PC0
  TIMERB3,      //  17 PC1
  NOT_ON_TIMER, //  18 PC2
  NOT_ON_TIMER, //  19 PC3
  NOT_ON_TIMER, //  20 PC4
  NOT_ON_TIMER, //  21 PC5
  NOT_ON_TIMER, //  22 PC6
  NOT_ON_TIMER, //  23 PC7
  NOT_ON_TIMER, //  24 PD0
  NOT_ON_TIMER, //  25 PD1
  NOT_ON_TIMER, //  26 PD2
  NOT_ON_TIMER, //  27 PD3
  NOT_ON_TIMER, //  28 PD4
  NOT_ON_TIMER, //  29 PD5
  DACOUT,       //  30 PD6
  NOT_ON_TIMER, //  31 PD7
  NOT_ON_TIMER, //  32 PE0
  NOT_ON_TIMER, //  33 PE1
  NOT_ON_TIMER, //  34 PE2
  NOT_ON_TIMER, //  35 PE3
  NOT_ON_TIMER, //  36 PE4
  NOT_ON_TIMER, //  37 PE5
  NOT_ON_TIMER, //  38 PE6
  NOT_ON_TIMER, //  39 PE7
  NOT_ON_TIMER, //  40 PF0 (TOSC1)
  NOT_ON_TIMER, //  41 PF1 (TOSC2)
  NOT_ON_TIMER, //  42 PF2
  NOT_ON_TIMER, //  43 PF3
  TIMERB0,      //  44 PF4
  TIMERB1,      //  45 PF5
  NOT_ON_TIMER, //  46 PG0
  NOT_ON_TIMER, //  47 PG1
  NOT_ON_TIMER, //  48 PG2
  TIMERB4,      //  49 PG3
  NOT_ON_TIMER, //  50 PG4
  NOT_ON_TIMER, //  51 PG5
  NOT_ON_TIMER, //  52 PG6
  NOT_ON_TIMER, //  53 PG7
  NOT_ON_TIMER, //  54 PF6 (RESET)
};


#endif

#endif
